Revit 2026 API

# LoadedFamilyIntegrityCheckCheckAllFamiliesSlow Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CheckAllFamiliesSlow(
	Document ADoc,
	ISet<ElementId> corruptFamilyIds
)
```
```vb
Public Shared Function CheckAllFamiliesSlow (
	ADoc As Document,
	corruptFamilyIds As ISet(Of ElementId)
) As Boolean
```
```cpp
public:
static bool CheckAllFamiliesSlow(
	Document^ ADoc,
	ISet<ElementId^>^ corruptFamilyIds
)
```
```fsharp
static member CheckAllFamiliesSlow :
        ADoc : Document *
        corruptFamilyIds : ISet<ElementId> -> bool
```

#### Parameters

ADoc Document

corruptFamilyIds ISetElementId

#### Return Value

Boolean

#### Reference

LoadedFamilyIntegrityCheck Class

Autodesk.Revit.DB Namespace